!pip install ipython-sql
!pip install psycopg2

In [1]:
import pandas as pd
import numpy as np

In [2]:
%load_ext sql
%sql postgresql://praveensingh:Admin260@localhost/TFQDB_INTERVIEW
%sql SELECT version();

 * postgresql://praveensingh:***@localhost/TFQDB_INTERVIEW
1 rows affected.

[('PostgreSQL 14.11 (Homebrew) on aarch64-apple-darwin23.2.0, compiled by Apple clang version 15.0.0 (clang-1500.1.0.2.5), 64-bit',)]


# QUERY # 1 - Remove Redundant Pairs												
### 	"Problem Statement :
- For pairs of brands in the same year (e.g. apple/samsung/2020 and samsung/apple/2020) 
      - if custom1 = custom3 and custom2 = custom4 : then keep only one pair
- For pairs of brands in the same year 
      - if custom1 != custom3 OR custom2 != custom4 : then keep both pairs
- For brands that do not have pairs in the same year : keep those rows as well"

In [3]:
original_table = %sql SELECT * FROM brands;
original_table

 * postgresql://praveensingh:***@localhost/TFQDB_INTERVIEW
6 rows affected.

[('apple', 'samsung', 2020, 1, 2, 1, 2),
 ('samsung', 'apple', 2020, 1, 2, 1, 2),
 ('apple', 'samsung', 2021, 1, 2, 5, 3),
 ('samsung', 'apple', 2021, 5, 3, 1, 2),
 ('google', None, 2020, 5, 9, None, None),
 ('oneplus', 'nothing', 2020, 5, 9, 6, 3)]

# Solution 1

In [4]:
%%sql

-- Common Table Expression (CTE) to calculate pair_id based on brand1, brand2, and year
WITH cte AS (
    SELECT *, 
           CASE WHEN brand1 < brand2 THEN concat(brand1, brand2, year)
                ELSE concat(brand2, brand1, year)
           END AS pair_id
    FROM brands
),
-- CTE to add row numbers within each pair_id group
cte_rn AS (
    SELECT *,
           ROW_NUMBER() OVER (PARTITION BY pair_id ORDER BY pair_id) AS rn
    FROM cte
)
-- Main query to select distinct pairs and filter based on conditions
SELECT brand1, brand2, custom1, custom2, custom3, custom4
FROM cte_rn
WHERE rn = 1 -- Select only the first row within each pair_id group
   OR (custom1 <> custom3 AND custom2 <> custom4); -- Select rows where custom1 is not equal to custom3 and custom2 is not equal to custom4

 * postgresql://praveensingh:***@localhost/TFQDB_INTERVIEW
5 rows affected.

[('apple', 'samsung', 1, 2, 1, 2),
 ('apple', 'samsung', 1, 2, 5, 3),
 ('samsung', 'apple', 5, 3, 1, 2),
 ('google', None, 5, 9, None, None),
 ('oneplus', 'nothing', 5, 9, 6, 3)]

# Query #2 
A ski resort company is planning to construct a new ski slope using a pre-existing network of
mountain huts and trails between them. A new slope has to begin at one of the mountain huts,
have a middle station at another hut connected with the first one by a direct trail, and end at
the third mountain hut which is also connected by a direct trail to the second hut. The altitude
of the three huts chosen for constructing the ski slope has to be strictly decreasing.
You are given two SQL tables, mountain_huts and trails, with the following structure:

In [5]:
mountain_huts = %sql select * from mountain_huts;
mountain_huts

 * postgresql://praveensingh:***@localhost/TFQDB_INTERVIEW
5 rows affected.

[(1, 'Dakonat', 1900),
 (2, 'Natisa', 2100),
 (3, 'Gajantut', 1600),
 (4, 'Rifat', 782),
 (5, 'Tupur', 1370)]

In [6]:
trails = %sql select * from trails;
trails

 * postgresql://praveensingh:***@localhost/TFQDB_INTERVIEW
5 rows affected.

[(1, 3), (3, 2), (3, 5), (4, 5), (1, 5)]

# Solution 2